# Parameter Type Id Rebar Shape Termination Rotation At Start Property

Source: https://www.revitapidocs.com/2026/1d7958ec-c04b-54c5-f5d7-bb5ff69fe93c.htm

---

| Parameter Type Id Rebar Shape Termination Rotation At Start Property |
| --- |

"Rotation At Start"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeTerminationRotationAtStart { get; }
```

```
Public Shared ReadOnly Property RebarShapeTerminationRotationAtStart As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeTerminationRotationAtStart {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeTerminationRotationAtStart : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace